---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.WeightPerUnitLength
source: html/d6c92c2c-9c7c-b224-5b26-6c4683c00b4d.htm
---
# Autodesk.Revit.DB.SpecTypeId.WeightPerUnitLength Property

Weight per Unit Length, in discipline Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId WeightPerUnitLength { get; }
```